cfe llm/InformationRegisters/AI_АгентскиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_АгентскиеОперации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СтатусАгентскойОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйПромт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДиалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаДиалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаЗапрошена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходящиеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокеныИнструментов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийНомерШага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеТокеныВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходящиеТокеныВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment/><Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДоступаКДанным</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСценария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКорреляции</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдемпотентныйКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючИсточника</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтекста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстJSON</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенВыполнения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АрендаДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОчищены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>
					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаДоставки</Name>
					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСистемногоПромта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксТокеновМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/CommonModules/AI_НаблюдаемостьОпераций/Ext/Module.bsl
Функция ЗаписатьОценку(ИдентификаторОперации, Решение, Комментарий = "", ИсправленныйОтвет = "", ИдентификаторОценки = Неопределено) Экспорт
	Если Решение <> "Принято" И Решение <> "Отклонено" И Решение <> "Исправлено" Тогда
		ВызватьИсключение "Решение должно быть: Принято, Отклонено или Исправлено.";
	КонецЕсли;
	Если ТипЗнч(Комментарий) <> Тип("Строка") Или ТипЗнч(ИсправленныйОтвет) <> Тип("Строка") Тогда
		ВызватьИсключение "Комментарий и исправленный ответ должны быть строками.";
	КонецЕсли;
	Если СтрДлина(Комментарий) > 10000 Или СтрДлина(ИсправленныйОтвет) > 1000000 Тогда
		ВызватьИсключение "Превышен размер обратной связи.";
	КонецЕсли;
	Если Решение = "Исправлено" И Не ЗначениеЗаполнено(ИсправленныйОтвет) Тогда
		ВызватьИсключение "Укажите исправленный ответ.";
	КонецЕсли;
	Если ИдентификаторОценки = Неопределено Тогда
		ИдентификаторОценки = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если ТипЗнч(ИдентификаторОценки) <> Тип("УникальныйИдентификатор") Тогда
		ВызватьИсключение "Идентификатор оценки должен быть UUID.";
	КонецЕсли;
	ИсходныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	Попытка
		AI_ДиспетчерОпераций.ЗаблокироватьОчередь();
		Операция = РегистрыСведений.AI_АгентскиеОперации.СоздатьМенеджерЗаписи();
		Операция.ИдентификаторОперации = ИдентификаторОперации;
		Операция.Прочитать();
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		Если Не Операция.Выбран() Или Операция.ИдентификаторПользователя <> Пользователь Тогда
			ВызватьИсключение "Операция недоступна текущему пользователю.";
		КонецЕсли;
		Если Операция.Статус <> Перечисления.AI_СтатусАгентскойОперации.Завершена Или Операция.ДанныеОчищены Тогда
			ВызватьИсключение "Оценить можно только сохраненный успешный результат.";
		КонецЕсли;
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить("РегистрСведений.AI_ОценкиРезультатов");
		Элемент.УстановитьЗначение("ИдентификаторОценки", ИдентификаторОценки);
		Блокировка.Заблокировать();
		Оценка = РегистрыСведений.AI_ОценкиРезультатов.СоздатьМенеджерЗаписи();
		Оценка.ИдентификаторОценки = ИдентификаторОценки;
		Оценка.Прочитать();
		Если Оценка.Выбран() Тогда
			Если Оценка.ИдентификаторПользователя <> Пользователь Или Оценка.ИдентификаторОперации <> ИдентификаторОперации
				Или Оценка.Решение <> Решение Или Оценка.Комментарий <> Комментарий Или Оценка.ИсправленныйОтвет <> ИсправленныйОтвет Тогда
				ВызватьИсключение "Идентификатор оценки уже использован для других данных.";
			КонецЕсли;
		Иначе
			Оценка.ИдентификаторОценки = ИдентификаторОценки;
			Оценка.ИдентификаторОперации = ИдентификаторОперации;
			Оценка.ИдентификаторПользователя = Пользователь;
			Оценка.ДатаОценки = ТекущаяДатаСеанса();
			Оценка.Решение = Решение;
			Оценка.Комментарий = Комментарий;
			Оценка.ИсправленныйОтвет = ИсправленныйОтвет;
			Оценка.ОтветМодели = Операция.Результат;
			Оценка.КодСценария = Операция.КодСценария;
			Оценка.ВерсияКонтракта = Операция.ВерсияКонтракта;
			Оценка.Агент = Операция.Агент;
			Оценка.Модель = Операция.Модель;
			Оценка.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		УстановитьПривилегированныйРежим(ИсходныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйРежим);
	Возврат ИдентификаторОценки;
КонецФункции

Функция ПолучитьСтатистику() Экспорт
	ИсходныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос(
			"ВЫБРАТЬ Статус, КОЛИЧЕСТВО(*) КАК Количество,
			| СУММА(ВходящиеТокены + ВходящиеТокеныВложений) КАК ВходящиеТокены,
			| СУММА(ВыходящиеТокены + ВыходящиеТокеныВложений) КАК ВыходящиеТокены,
			| СУММА(ВЫБОР КОГДА СтатусДоставки = ""Ошибка"" ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ОшибокДоставки,
			| ЕСТЬNULL(СРЕДНЕЕ(ВЫБОР КОГДА ДатаПервогоЗапуска > &ПустаяДата
			| ТОГДА РАЗНОСТЬДАТ(ДатаСоздания, ДатаПервогоЗапуска, СЕКУНДА) ИНАЧЕ NULL КОНЕЦ), 0) КАК ОжиданиеСекунд
			|ИЗ РегистрСведений.AI_АгентскиеОперации
			|ГДЕ ИдентификаторПользователя = &Пользователь
			|СГРУППИРОВАТЬ ПО Статус");
		Запрос.УстановитьПараметр("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
		Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
		Выборка = Запрос.Выполнить().Выбрать();
		Результат = Новый Массив;
		Пока Выборка.Следующий() Цикл
			СтрокаСтатистики = Новый Структура("Статус,Количество,ВходящиеТокены,ВыходящиеТокены,ОшибокДоставки,ОжиданиеСекунд");
			ЗаполнитьЗначенияСвойств(СтрокаСтатистики, Выборка);
			Результат.Добавить(СтрокаСтатистики);
		КонецЦикла;
	Исключение
		УстановитьПривилегированныйРежим(ИсходныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйРежим);
	Возврат Результат;
КонецФункции

Процедура ОчиститьТекстыОценок() Экспорт
	Дней = Константы.AI_СрокХраненияОценокДней.Получить();
	Если Дней <= 0 Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 100 ИдентификаторОценки
		|ИЗ РегистрСведений.AI_ОценкиРезультатов
		|ГДЕ ИдентификаторПользователя = &Пользователь И НЕ ДанныеОчищены И ДатаОценки < &Граница");
	Запрос.УстановитьПараметр("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	Запрос.УстановитьПараметр("Граница", ТекущаяДатаСеанса() - Дней * 86400);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			Элемент = Блокировка.Добавить("РегистрСведений.AI_ОценкиРезультатов");
			Элемент.УстановитьЗначение("ИдентификаторОценки", Выборка.ИдентификаторОценки);
			Блокировка.Заблокировать();
			Запись = РегистрыСведений.AI_ОценкиРезультатов.СоздатьМенеджерЗаписи();
			Запись.ИдентификаторОценки = Выборка.ИдентификаторОценки;
			Запись.Прочитать();
			Запись.Комментарий = "";
			Запись.ОтветМодели = "";
			Запись.ИсправленныйОтвет = "";
			Запись.ДанныеОчищены = Истина;
			Запись.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьОшибкиДоставки() Экспорт
	ИсходныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 100 ИдентификаторОперации, КодСценария, ОшибкаДоставки, ДатаЗавершения
			|ИЗ РегистрСведений.AI_АгентскиеОперации
			|ГДЕ ИдентификаторПользователя = &Пользователь И СтатусДоставки = ""Ошибка""
			|УПОРЯДОЧИТЬ ПО ДатаЗавершения УБЫВ");
		Запрос.УстановитьПараметр("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
		Выборка = Запрос.Выполнить().Выбрать();
		Результат = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ОшибкаДоставки = Новый Структура("ИдентификаторОперации,КодСценария,ОшибкаДоставки,ДатаЗавершения");
			ЗаполнитьЗначенияСвойств(ОшибкаДоставки, Выборка);
			Результат.Добавить(ОшибкаДоставки);
		КонецЦикла;
	Исключение
		УстановитьПривилегированныйРежим(ИсходныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйРежим);
	Возврат Результат;
КонецФункции

Функция ПолучитьПоследниеОперации() Экспорт
	ИсходныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 100 ИдентификаторОперации, ДатаСоздания, ДатаЗавершения, КодСценария,
			| Статус, Результат, ТекстОшибки, СтатусДоставки, ОшибкаДоставки,
			| ВходящиеТокены + ВходящиеТокеныВложений КАК ВходящиеТокены,
			| ВыходящиеТокены + ВыходящиеТокеныВложений КАК ВыходящиеТокены
			|ИЗ РегистрСведений.AI_АгентскиеОперации
			|ГДЕ ИдентификаторПользователя = &Пользователь И КодСценария <> """"
			|УПОРЯДОЧИТЬ ПО ДатаСоздания УБЫВ");
		Запрос.УстановитьПараметр("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
		Результат = Запрос.Выполнить().Выгрузить();
	Исключение
		УстановитьПривилегированныйРежим(ИсходныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйРежим);
	Возврат Результат;
КонецФункции
